Tekla Open API Reference for Tekla Structures 2025
Assertion.Equals Method
 The equals.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override bool Equals(
	Object obj
)
Public Overrides Function Equals (
	obj As Object
) As Boolean
Parameters
obj
Type: System.Object
 The obj.
Return Value
Type: Boolean
 The Boolean.
See Also
Reference
Assertion Class
Tekla.Structures Namespace